[{"_id":"5a0603431616ad90131eb174","ID":2817,"sessioncode":"AP18","title":".NET Framework Improvements, Tips, and Tricks","abstract":"There's a lot of talk about the .NET Core framework, but what about the .NET Framework for Windows? With the recent releases of .NET and the Windows 10 Fall Creators Update, there are lots of improvements that you can use in your existing applications. Join us as we learn about the new features for Windows Forms, WPF, and ASP.NET developers in Visual Studio 2017 and Windows.","eventName":"2018 Spring","sessionID":2817,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["ASP","AB"],"tracks":["197","200"],"speakerNames":["Jeff Fritz"],"speakers":["1109"],"__v":1},{"_id":"5a0603e31616ad90131eb176","ID":2818,"title":".NET Standard: The Easy Route to Platform Independence","abstract":"Microsoft is moving to an Open Source and cross platform world, and they've created .NET Standard as a super-highway to get you there. With the .NET Standard 2.0 release, the specification includes most of the API's you depend on in the .NET full framework (.NET 4.n). Because .NET Standard, .NET Core, Xamarin and UWP are all embracing this standard, your class libraries can easily be cross-platform. In this session, you'll learn more about the goals of .NET Standard and how it differs from PCLs (Portable Class Libraries). You'll also see how to use the .NET Portability Analyzer to find any changes your app needs. To show that .NET Standard is not actual magic, you'll learn a little about how redirects support binary compatibility. And, you'll learn what happens when an API just doesn't make sense on a particular platform and other potential pitfalls. You'll leave this session understanding why you care about .NET Standard and the path to move your applications to it.","sessioncode":"AP19","eventName":"2018 Spring","sessionID":2818,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["ASP","AB"],"tracks":["197","200"],"speakerNames":["Kathleen Dollard"],"speakers":["1007"],"__v":1},{"_id":"5a0604281616ad90131eb178","ID":2819,"sessioncode":"AP20","title":".NET in 2018 - Build Your Application and Run It Anywhere","abstract":"Developing with .NET is easier than ever, and now you can run your applications on any platform thanks to .NET Core.  Your existing knowledge of languages and frameworks can be re-used in all of the new places that .NET can reach.  In this demo-filled session, you'll learn how to get started with .NET Core and the .NET SDK to build a simple set of tools that can be run everywhere from the cloud, to a Raspberry Pi and even on your refrigerator with Tizen. We'll also look at how your existing code can be re-used in all of these new places as well.","eventName":"2018 Spring","sessionID":2819,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["ASP","AB"],"tracks":["197","200"],"speakerNames":["Scott Hunter"],"speakers":["1248"],"__v":1},{"_id":"5a032c0ff2716bdc11fa6927","ID":2784,"sessioncode":"AP03","title":"6 Design Patterns to Improve Your Web Apps","abstract":"Design patterns provide common templates for solving similar problems. They also provide a higher-level language for software developers to use to describe approaches they might choose when designing part of an application. Learn several patterns useful to web application developers.","eventName":"2018 Spring","sessionID":2784,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["ASP","AB"],"tracks":["197","200"],"speakerNames":["Steve Smith"],"speakers":["1262"],"__v":0},{"_id":"5a032601f2716bdc11fa6914","ID":2779,"sessioncode":"AB12","title":"7 D's of Development","abstract":"Are you done delivering that code? What is done? Are you confident it till stay up and running? Are you confident that the bug you fixed didn't break something else? Are you confident someone else could pick up your code and run with it? Writing code is the easy part, everything after it is the hard part. Following the 7 D's of development will help you deliver higher quality product and make you feel more confident about saying \"it's done\".","eventName":"2018 Spring","sessionID":2779,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["AB","ASP"],"tracks":["200","197"],"speakerNames":["John Papa"],"speakers":["1002"],"__v":0},{"_id":"5a25cc636069b5a438456556","ID":2994,"sessioncode":"AI06","title":"A lap around Microsoft Cognitive Services Vision APIs","abstract":"How would you like to learn how to leverage machine learning in countless Computer Vision use cases the easy way? Recently, Computer Vision Technologies have skyrocketed. Why? Machine Learning and a number of brilliant people working on Computer Vision. <br /><br /> Machine Learning is currently a hot topic and holds a bold promise yet to be truly exploited. But, no matter what your level of understanding of Machine Learning is, we all can agree that it is a broad technology whose pioneers and leaders have a very specific expertise in. In other words, it just does not make sense for all developers to be experts in machine learning. It is more important for developers to understand how to leverage machine learning in your applications. <br /><br /> The Vision APIs of Microsoft Cognitive Services are easy to implement, free to prototype and inexpensive to scale in production. There is a rich set of services and a comprehensive SDK. And best of all the Vision APIs leverage billions of dollars spent in Microsoft Research and cloud infrastructure. <br /><br /> The Vision of Microsoft Cognitive Services (formerly Project Oxford) is for more personal computing experiences and enhanced productivity aided by systems that increasingly can see, hear, speak, understand and even begin to reason. <br /><br /> Microsoft Cognitive Services are a set of APIs, SDKs and services available to developers to make their applications more intelligent, engaging and discoverable. Microsoft Cognitive Services expands on Microsoft’s evolving portfolio of machine learning APIs and enables developers to easily add intelligent features – such as emotion and video detection; facial, speech and vision recognition; and speech and language understanding – into their applications. <br /><br /> Take a lap around the features and functionality of the Microsoft Cognitive Services Vision APIs with Tim Huckaby to see how powerful these services are and how easy they are to implement in your own applications.","eventName":"2018 Spring","sessionID":2994,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["AI","AB"],"tracks":["202","200"],"speakerNames":["Tim Huckaby"],"speakers":["1013"],"__v":0},{"_id":"5aa7ea4167dbf9f01377fc86","ID":3103,"sessioncode":"AI10","title":"AI & Machine Learning in the Industry – Real-World Case Studies Using Microsoft Cognitive Services and Cognitive Toolkit (CNTK)","abstract":"AI & Machine Learning in the Industry – Real-World Case Studies Using Microsoft Cognitive Services and Cognitive Toolkit (CNTK)","eventName":"2018 Spring","sessionID":3103,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"topics":[null],"tags":[null],"personas":[null],"products":[null],"trackNames":["AI","VS"],"tracks":["202","196"],"speakerNames":["Dr. Adnan Masood"],"speakers":["1504"],"__v":0},{"_id":"5a2ac25b6069b5a438456576","ID":3002,"sessioncode":"AI09","title":"AI Keynote: See the Future through the Eyes of Computer Vision","abstract":"Artificial Intelligence (AI) has the potential to be the most beautiful Technology every invented.  Nevertheless, we are just on the cusp of this huge wave of AI innovation.  We are AI technology pioneers.  With existing solved problems in Artificial Intelligence and many more to come, we have the bold responsibility to amplify human ingenuity and solve some of the world’s most difficult problems.\n<br /><br />\nHow is Computer vision, machine learning, and mixed reality designed into innovative software built on the latest and greatest emerging experiences?\n<br /><br />\nJoin Tim Huckaby in a demo heavy keynote focused on the power of Computer Vision: Designing, developing, and putting interactive AI solutions into production.","eventName":"2018 Spring","sessionID":3002,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["AI","VS","AB"],"tracks":["202","196","200"],"speakerNames":["Tim Huckaby"],"speakers":["1013"],"__v":0},{"_id":"59e4d677a4cd12f41e1f3cca","ID":2747,"sessioncode":"VS01","title":"Actors - The Past and Future of Software Engineering","abstract":"The Actor Model is the latest fad to storm the software industry. But is there any substance behind it and why should you care? What are the drivers of the Actor Model and why have the large cloud vendors started offering Actor-based solutions?  Juval Lowy puts it all together first by outlining the long-term trend in software methodologies that brought this 50-years old computational model to the fore, and how the demise of Moore's Law coupled with the rise of the IoT will force us to abandon sequential programming. Juval will examine the origin of the Actor Model; demonstrate Actors using conceptual examples, outline emerging design patterns, point out common misconceptions and conclude with his views on the future of the Actor Model.","eventName":"2018 Spring","sessionID":2747,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["VS","AB"],"tracks":["196","200"],"speakerNames":["Juval Lowy"],"speakers":["1188"],"__v":0},{"_id":"5a206691e137e7380e34482a","ID":2947,"abstract":"<strong>Level: </strong>400<br /><br />Disasters happen – plain and simple. When disaster strikes a database you're responsible for, and backups and repair fail, how can you salvage data, and possibly your company and your job? This is where advanced data recovery techniques come in. Using undocumented tools and deep knowledge of database structures, you can manually patch up the database enough to extract critical data. This demo-heavy session will show you advanced methods I've used extensively over the years to salvage data for real-life clients after catastrophic corruption. You won't believe what it's possible to do!","sessioncode":"SQ08","title":"Advanced Data Recovery Techniques","eventName":"2018 Spring","sessionID":2947,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["SQL"],"tracks":["199"],"speakerNames":["Paul Randal"],"speakers":["1186"],"__v":0},{"_id":"5a6f5d6dac33dfb8272e083a","ID":3057,"title":"An Introduction to Azure Managed Instances","abstract":"<strong>Level: </strong>200<br /><br />Have you been hearing about Azure Managed Instances and want to know what all the fuss is about? Come see how Managed Instances are changing how we think about cloud databases. Managed Instances can be considered a hybrid of Azure SQL Database and on-premises SQL Server with all the great benefits of Platform as a Service (PaaS). You’ll see first-hand how easy it is to migrate databases from on-premises to a Managed Instance. We’ll explore the differences between Azure SQL Database, Managed Instances, and SQL Server on an Azure VM to help you determine which is the best fit for your organization's requirements. If you’ve been considering Azure for your organization, this session is for you!","sessioncode":"SQ44","eventName":"2018 Spring","sessionID":3057,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"topics":[null],"tags":[null],"personas":[null],"products":[null],"trackNames":["SQL"],"tracks":["199"],"speakerNames":["Tim Radney"],"speakers":["1227"],"__v":0},{"_id":"5a031e71f2716bdc11fa6909","ID":2774,"sessioncode":"AB07","title":"An Introduction to React","abstract":"Facebook's React library has received quite a bit of attention lately. In this session we will describe what React is, who uses it, and why it's a compelling technology to use.\n<br /><br />\nAfter a high level overview we will start to unpacking the ins and outs of React components (creation/JSX/props/state/etc) and then discuss some of the gotchas when first starting development.\n<br /><br />\n\"My favorite part of React is what I loved about MooTools: to use it effectively you learn JavaScript, not a DSL: useful your whole career.\"\" --Ryan Florence\n<br /><br />\nReact by itself is fairly small and not overly complex. For a more comprehensive Single Page Application you need much more than just React. To address this concern we will discuss Facebook Flux architecture, introduce the concept of Isomorphic JavaScript, and identify other libraries that are common when building a full application.\"","eventName":"2018 Spring","sessionID":2774,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["AB","ASP"],"tracks":["200","197"],"speakerNames":["Elijah Manor"],"speakers":["1075"],"__v":0},{"_id":"5a0604921616ad90131eb17a","ID":2820,"sessioncode":"AP21","title":"Application modernization with Microsoft Azure","abstract":"Learn how Azure helps modernize applications faster with containers and how you can use serverless to add additional functionality while keeping your production codebase 'clean'. We'll also learn how to incorporate DevOps throughout your apps lifecycle, and take advantage of data-driven intelligence.","eventName":"2018 Spring","sessionID":2820,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["ASP","AB"],"tracks":["197","200"],"speakerNames":["Mikkel Mork Hegnhoj"],"speakers":["1420"],"__v":1},{"_id":"5a032bcbf2716bdc11fa6925","ID":2783,"sessioncode":"AP02","title":"Architecting ASP.NET Core Solutions","abstract":"ASP.NET Core provides better support for clean, testable, maintainable architectures than any of its predecessors. Learn the underlying principles that apply to project/solution organization, how best to arrange your projects to support clean code, and how to refactor existing solutions toward this architecture.","eventName":"2018 Spring","sessionID":2783,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["ASP","AB"],"tracks":["197","200"],"speakerNames":["Steve Smith"],"speakers":["1262"],"__v":0},{"_id":"5a04a28f1616ad90131eb142","ID":2793,"sessioncode":"VS03","title":"Artificial Intelligence for the pragmatic developer","abstract":"As a developer, you’re probably thinking AI is something that only data scientists work on, and unless you want to go back to an get a PhD in statistics, it’s not for you. I’m happy to prove you wrong. If you are a developer building real-world solutions you are already 2/3rds of the way towards leveraging the tremendous improvements in machine learning and artificial intelligence that have occurred in recent years. In this pragmatic session, we look at how you the developer can leverage Azure Machine Learning (including the newly announced Experimentation and Model Management Services) and the Cognitive Services into your overall Azure solution architectures. Machine Learning usually does not stand by itself in the solution…whether you are using as Azure ML as the foundation for a data mining effort, using it as web service to inform automated processes or simply employing ML directly to realize new, untapped values in your data, Azure ML sits as an important and integrated component of your solution architecture. New services such as those provided with Microsoft Cognitive Services speed your development time by providing you with sophisticated, fully trained models for performing speech, text, vision and recommendation functions with the ease of integrating a REST API can yield richer and deeper interactive user experiences than was possible without having a specialized team with huge development budgets. Learn to bring intelligence to your solutions by attending this session!","eventName":"2018 Spring","sessionID":2793,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["Azure","AB","VS"],"tracks":["201","200","196"],"speakerNames":["Zoiner Tejada"],"speakers":["1012"],"__v":0},{"_id":"5a256c5b6069b5a438456506","ID":2957,"sessioncode":"SQ14","abstract":"<strong>Level: </strong>200<br /><br />Most of the time, conventional clustered and nonclustered indexes work well - but not all of the time. When you really need to push performance, hand-crafted special index types can give you an amazing boost. Learn the catches behind filtered indexes, indexed views, and computed columns.","title":"Artisanal Indexes: Filters, Views, Computed Columns","eventName":"2018 Spring","sessionID":2957,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["SQL"],"tracks":["199"],"speakerNames":["Brent Ozar"],"speakers":["1187"],"__v":0},{"_id":"5a25c9e16069b5a438456552","ID":2992,"sessioncode":"AZ09","abstract":"If you want to be 10x more efficient solving cloud reliability and performance issues, this session is for you. We’ll cover top issues we encounter in your application and infrastructure, and provide you with modern tools and techniques to effectively monitor, diagnose and fix these issues in all your environments, from dev-test to production at-scale. The session will cover our modern APM metrics and logging technology, Application Insights Profiler, and using the new Snapshot Debugger in production. Put on your seatbelts for this one!","title":"Azure Diagnostics: Fixing Cloud Applications Issues and Performance on Azure","eventName":"2018 Spring","sessionID":2992,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["Azure","VS","AB"],"tracks":["201","196","200"],"speakerNames":["Paul Yuknewicz"],"speakers":["1292"],"__v":0},{"_id":"5a6f5c81ac33dfb8272e0838","ID":3056,"sessioncode":"SQ43","title":"Azure SQL Database for the Production DBA","abstract":"<strong>Level: </strong>200<br /><br />Have you been wondering what Azure SQL Database is and what it means for you as a production DBA? Azure SQL Database is an Enterprise-ready database platform that provides relational database-as-a-service. In this session, you’ll get a grounding in the fundamentals of Azure SQL Database from a DBA perspective. First, you'll learn how to create an Azure SQL Database using the Azure Portal and an approach for sizing a new Azure SQL Database. Then, you'll learn some of the similarities and differences between on-premises SQL Server and Azure SQL Database. Finally, you'll see how monitoring and performance tuning Azure SQL Database differs from on-premises SQL Server. If you’ve been considering Azure SQL Database for your organization, this session is for you!","eventName":"2018 Spring","sessionID":3056,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"topics":[null],"tags":[null],"personas":[null],"products":[null],"trackNames":["SQL"],"tracks":["199"],"speakerNames":["Tim Radney"],"speakers":["1227"],"__v":0},{"_id":"5a05b1fa1616ad90131eb14c","ID":2797,"sessioncode":"VS07","title":"Build Your First Xamarin App in 60 Minutes","abstract":"Xamarin enables C# developers to reuse their skills and build native mobile apps that run on iOS, Android and Windows. In this session, we will build a mobile app from scratch. You will see how to build the UI, handle navigation, connect to Azure, work with data when offline and how to deploy the app to multiple devices.","eventName":"2018 Spring","sessionID":2797,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["VS","AB"],"tracks":["196","200"],"speakerNames":["Robert Green"],"speakers":["1042"],"__v":1,"personas":[null],"products":[null],"tags":[null],"topics":[null]},{"_id":"5a05f8d51616ad90131eb15a","ID":2804,"sessioncode":"VS13","abstract":"The absolute number one request for a bot is to have one that handles the 100 or 1000 most common requests in customer service. This allows not only quicker result times but allows your people to give better customer service. Come to this session to learn how to implement this for your company.","title":"Build a Customer Service Bot for your company. I will show you how","eventName":"2018 Spring","sessionID":2804,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["VS","AB"],"tracks":["196","200"],"speakerNames":["Daniel Egan"],"speakers":["1037"],"__v":0},{"_id":"5a25b0eb6069b5a43845652f","ID":2977,"sessioncode":"SQ34","abstract":"<strong>Level: </strong>200<br /><br />Database backups are often critical for recovering from a disaster, but there are lots of misconceptions about how backups work and what a good backup strategy is. The purpose of taking backups is, of course, to be able to restore them at some point - but that can sometimes be easier said than done, depending on what you want to be able to restore. In this session, Paul will explain how the three most common types of backups work and how they can be combined into effective backup strategies. Paul will also cover how restore works and what you can do to make your restores run faster. This session provides the knowledge you need to make sure you can recover within your downtime target.","title":"Building a Better Backup Strategy","eventName":"2018 Spring","sessionID":2977,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["SQL"],"tracks":["199"],"speakerNames":["Paul Randal"],"speakers":["1186"],"__v":1,"personas":[null],"products":[null],"tags":[null],"topics":[null]},{"_id":"5a05f6de1616ad90131eb156","ID":2802,"sessioncode":"VS11","title":"Building a Holographic Assistant with Bot Framework, LUIS & Mixed Reality","abstract":"Take your customers’ bots beyond Skype, Slack, Microsoft Teams and Facebook and bring them into the real world with Mixed Reality. Why simply type-chat with a bot when you could actually look at them, talk to them and listen to their answers? HoloBot is an open source reusable Windows Mixed Reality Unity project for Microsoft HoloLens that acts as a holographic client for a chatbot. HoloBot has already been used in the pharmaceutical industry where lab scientists can lookup procedure documents using voice and gestures, and review those documents as holograms visible in their work space. This session is a deep dive into this 3D app that lets users interact with a 3D floating avatar using speech recognition, getting answers spoken back by the \"bot\" using Text-to-Speech. The commands sent to the bot are powered by the Microsoft Bot Framework via the Direct Line API, and parsed by LUIS from Microsoft Cognitive Services.","eventName":"2018 Spring","sessionID":2802,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["VS","AB"],"tracks":["196","200"],"speakerNames":["Nick Landry"],"speakers":["1162"],"__v":0},{"_id":"5a7a07aa610cdd98146d55ce","ID":3062,"title":"Bulletproof Transient Error Handling with Polly","abstract":"Connected applications only work when connected. What happens if the network breaks temporarily? Will your system recover smoothly or pitch a fit? Using an OSS project called Polly (available on GitHub and now part of the .NET Foundation) you can handle this and many other transient situations with elegance and fluency. Polly let’s you define retry policies using standard patterns such as retry, retry forever, wait and retry, and circuit breaker. Learn how to make your system bulletproof with Polly and a little know-how.","sessioncode":"VS21","eventName":"2018 Spring","sessionID":3062,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"topics":[null],"tags":[null],"personas":[null],"products":[null],"trackNames":["VS"],"tracks":["196"],"speakerNames":["Carl Franklin"],"speakers":["1241"],"__v":0},{"_id":"5a032a91f2716bdc11fa6921","ID":2781,"sessioncode":"AB14","title":"Bundle all the things! An introduction to webpack","abstract":"As our web development code moves further and further towards the front-end, and the browser becoming more of a host for running complex programs, the need for managing our front-end resources becomes bigger...and harder. There are several ways to handle this problem, but currently it appears as though webpack is the way that people are gravitating towards. <br /><br />\nUnfortunately, getting started with webpack offers a bit of a hurdle. Webpack configurations can look fairly complicated, and getting started can seem like a daunting task. However, with large JavaScript frameworks like Angular and Aurelia buying into it, we developers don’t have much choice in a lot of cases. We pretty much have to understand it!\nIn this session, you will get an introduction to how webpack works, the concepts behind it, and how to get started with it. The topic is too big to make you an expert in an hour, but hopefully you will walk out understanding the concepts well enough to both start configuring your own bundles and be able to understand the complicated bundle configurations you might run across.","eventName":"2018 Spring","sessionID":2781,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["AB","ASP"],"tracks":["200","197"],"speakerNames":["Chris Klug"],"speakers":["1344"],"__v":0},{"_id":"5a05b0971616ad90131eb148","ID":2795,"sessioncode":"VS05","title":"C# 7.x Like a Boss!","abstract":"Hey - you - are you using C# to its fullest potential? Have you started yet on say.. C# 6?\n<br /><br />\nWell, it's time to look at C# 7 from a practical standpoint. Sure, we can look at a a one-liner sample, but let's look at some real examples of where C# 7 can be used to solve a problem or just make your code better. Some of the new C# 7 features include pattern matching, local functions, tuples, and more. If you are wondering how some of this works behind the scenes then fear not we'll cover how some of this compiles.","eventName":"2018 Spring","sessionID":2795,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["VS","AB"],"tracks":["196","200"],"speakerNames":["Adam Tuliper"],"speakers":["1179"],"__v":0},{"_id":"5a25c2546069b5a438456540","ID":2984,"sessioncode":"AI01","title":"Cognitive Search and Augmentation","abstract":"Imagine a world where enterprises can search on all of their data at one time, no matter what the source, whether images, audio, PDFs, forms, etc. Data sources are often in raw, unstructured formats from different databases and there’s a treasure trove of insights to be had. Microsoft Cognitive Services and Azure Search can be combined to do just that. Join this session to learn the future plans we have in Cloud AI to enable these capabilities for your customer.","eventName":"2018 Spring","sessionID":2984,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["AI","AB"],"tracks":["202","200"],"speakerNames":["Microsoft AI Team"],"speakers":["1574"],"__v":0},{"_id":"5a256dbf6069b5a43845650c","ID":2960,"sessioncode":"SQ17","abstract":"<strong>Level: </strong>200<br /><br />Making mistakes is natural, but learning from them and avoiding them in future takes effort. There's no substitute for experience or the shared wisdom of others to help you learn what mistakes to avoid. In this session, Tim will share with you a ton of what he's learned over the years from working and consulting at multiple Fortune-level companies. You'll hear about real-world environments he has worked on where there was a high impact from administrators making mistakes in how SQL Server was configured and administered. You'll learn many proven and accepted best practices for installing, configuring and supporting SQL Server to help your environment run as smoothly as possible and you'll leave with a checklist of items to take home to make sure your SQL Server environment is configured properly.","title":"Common SQL Server Mistakes and How to Avoid Them","eventName":"2018 Spring","sessionID":2960,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["SQL"],"tracks":["199"],"speakerNames":["Tim Radney"],"speakers":["1227"],"__v":0},{"_id":"5a256e856069b5a438456510","ID":2962,"sessioncode":"SQ19","abstract":"<strong>Level: </strong>300<br /><br />Introduced in SQL Server 2012, Columnstore Indexes have the power to completely transform a reporting environment. These indexes offer a solution for your reporting workload with an order of magnitude better data compression and query performance over traditional tables and indexes. SQL Server 2016 significantly enhances these indexes so that you can take advantage of them with your OLTP workload to enable something known as Operational Analytics. This session will dig into what Columnstore Indexes are, how they are implemented, and the advantages of using this technology in SQL Server 2016.","title":"Conquering Columnstore Indexes","eventName":"2018 Spring","sessionID":2962,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["SQL"],"tracks":["199"],"speakerNames":["Tim Chapman"],"speakers":["1221"],"__v":0},{"_id":"5a256e226069b5a43845650e","ID":2961,"sessioncode":"SQ18","abstract":"<strong>Level: </strong>300<br /><br />There is so much more to writing faster SQL Server applications than just tacking on a NOLOCK hint to queries. This session will thoroughly discuss what isolation levels mean in the SQL Server universe, how interaction between resources occurs in each isolation level as well as different adverse effects to each isolation level. The session will include the common SQL Server isolation levels as well as the lesser-known optimistic isolation levels as well as how multi-version concurrency control works with In-Memory OLTP.","title":"Conquering Concurrency","eventName":"2018 Spring","sessionID":2961,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["SQL"],"tracks":["199"],"speakerNames":["Tim Chapman"],"speakers":["1221"],"__v":0},{"_id":"5a2065c8e137e7380e344828","ID":2946,"sessioncode":"SQ07","abstract":"<strong>Level: </strong>200-300<br /><br />Your database is corrupt - what do you do? Well, it depends! How critical is the data? Do you know what's really wrong with the database? What does all that DBCC CHECKDB output mean? Should you restore or repair? It’s all about limiting downtime and data-loss when a corruption occurs - from knowing the tools to understanding the implications of choices you make. In this demo-heavy session Paul will give you insight into how to recover from corruption without making things worse. Most importantly you'll get step-by-step instructions for dealing with the more common scenarios.","title":"Corruption Survival Techniques","eventName":"2018 Spring","sessionID":2946,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["SQL"],"tracks":["199"],"speakerNames":["Paul Randal"],"speakers":["1186"],"__v":0},{"_id":"5a9493c36134c81814736298","ID":3092,"sessioncode":"VS23","abstract":"We all have gone to conferences and sees a lot of the same. The best conferences have dynamic talks, amazing companies, and great engineers in attendance. It slowly becomes a part of what we all just expect. But what if I told you we can do better? What if we could use technology that already exists to enhance everyone's experience just a little bit? This talk is aimed at showing how developers can use Twilio, .NET, and Microsoft Azure to create applications that invite users to be a part of their conference attendee experience. We will walk through how to build a digital jukebox that is powered by Spotify and runs on Angular with an Azure function based serverless backend.","title":"Crowdsource Your Music with Twilio & Azure","eventName":"2018 Spring","sessionID":3092,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"topics":[null],"tags":[null],"personas":[null],"products":[null],"trackNames":["VS","Azure"],"tracks":["196","201"],"speakerNames":["Corey Weathers","David Prothero"],"speakers":["1646","1645"],"__v":0},{"_id":"5a256fc66069b5a438456515","ID":2964,"sessioncode":"SQ21","abstract":"<strong>Level: </strong>400<br /><br />This topic sounds scary, but it’s not. Regardless of whether you have a small database with only a few users, or a large multi-tenant system, you have Locking, Blocking, Latches, and Spinlocks. Understanding what they are and how they work is the first step in understanding how to troubleshoot them. Deadlocks are a problem, but they are a problem we can fix. In this session, we will explain and investigate how to find and fix the problems that we see in our database every day.","title":"Deep Dive into Locking, Blocking & Latches","eventName":"2018 Spring","sessionID":2964,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["SQL"],"tracks":["199"],"speakerNames":["Gareth Swanepoel"],"speakers":["1573"],"__v":0},{"_id":"5a904d821cb7424009c9e35c","ID":3087,"sessioncode":"AZ11","title":"Developing for Azure using Visual Studio Code","abstract":"Visual Studio Code is the award-winning source code editor from Microsoft that's built for any developer on any platform. Through a series of team collaborations within Microsoft and with contributions from OSS developers, a series of exciting new Visual Studio Code extensions have been released that make developing apps on Microsoft Azure easier than ever. Come learn how you can use the Azure extensions to Visual Studio Code to streamline resource creation, configuration, and management from directly within the editor, and how data-editing and deployment tools can enable developers to effortlessly use Azure as a development environment for rapid development and testing. We'll cover handy tools for Azure App Service and Functions, Docker containers, and how to use data-management tools like the Azure Cosmos DB and SQL Server extensions. You'll also see demos of more advanced techniques, like using the Azure IoT extension for monitoring hardware, the Azure CLI tools for managing your resources, and more.","eventName":"2018 Spring","sessionID":3087,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"topics":[null],"tags":[null],"personas":[null],"products":[null],"trackNames":["Azure","AB","VS"],"tracks":["201","200","196"],"speakerNames":["Brady Gaster"],"speakers":["1291"],"__v":0},{"_id":"5a12f84246276db406c2392e","ID":2866,"sessioncode":"AZ01","title":"Docker Containers on Azure - Let me count the ways","abstract":"There is already significant momentum in the industry toward building applications for containerized environments - with Docker leading the way. If you don’t develop applications with containers and microservices architecture in mind, rest assured you will. Not all microservices architectures and Docker applications look alike, however, and there are choices to to level of necessary complexity and management to be considered. This session will provide an overview of the many ways you can deploy your Docker applications to Azure from the simple serverless approach through to container orchestration platforms and hosting options. You’ll get a tour of Azure Container Instances, App Services for Containers, overall orchestration platform support in Azure including Docker Swarm, Docker EE, Mesosphere DC / OS and Kubernetes - including the managed service provided by Azure Kubernetes Service (AKS). By the end of this session you will get a taste of each option, and gain perspective on the design decisions that may lead to choosing between them.","eventName":"2018 Spring","sessionID":2866,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["Azure","AB"],"tracks":["201","200"],"speakerNames":["Michele Leroux Bustamante"],"speakers":["1011"],"__v":1,"personas":[null],"products":[null],"tags":[null],"topics":[null]},{"_id":"5a256edb6069b5a438456512","ID":2963,"sessioncode":"SQ20","abstract":"<strong>Level: </strong>200<br /><br />Dynamic SQL is one of the most powerful tools in the database developer's arsenal. After working with it for over a decade, I'll share my tips and tricks.","title":"Dynamic SQL: Building, Tuning, and Testing It Better","eventName":"2018 Spring","sessionID":2963,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["SQL"],"tracks":["199"],"speakerNames":["Brent Ozar"],"speakers":["1187"],"__v":0},{"_id":"5a2063f7e137e7380e344822","ID":2943,"sessioncode":"SQ04","abstract":"<strong>Level: </strong>200<br /><br />When SQL Server processes a query, it can be difficult to understand “why” it processed your query/procedure the way in which it did. One of the first things looked at is the “estimate” of rows. When the estimate is off from the actual – statistics are often blamed. Come to this session to understand how parameters, literals, and variables are evaluated and estimated. Understanding how to best troubleshooting these problems is the first part of the problem… once you can determine the source of the problem, then you can determine how to fix it. This session is all about understanding estimates based on how your queries and procedures are both written as well as executed.","title":"Estimates & Statistics: Parameters, Literals, and Variables","eventName":"2018 Spring","sessionID":2943,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["SQL"],"tracks":["199"],"speakerNames":["Kimberly L. Tripp"],"speakers":["1184"],"__v":0},{"_id":"5a206365e137e7380e344820","ID":2942,"sessioncode":"SQ03","title":"Experience SQL Server and Azure SQL Database: The Fast and the Furious","abstract":"<strong>Level: </strong>300-400<br /><br />Is your database slowing down your business? Are you using Linux as a platform but can’t find the right database that meets your performance needs without busting your budget? Built on the industry recognized “It just runs faster” SQL Server 2016 engine, SQL Server 2017 and Azure SQL Database provide new capabilities for performance, value, and choice. In this session, we show you features and a “behind the scenes look” at what powers SQL Server 2017 for Linux, Windows, and Azure SQL Database to give you the “speed you need”. And if you are a database expert and want to tune the SQL Server engine to its maximum turbocharged capacity, we show you the tools, diagnostics, and techniques that make SQL Server 2017 and Azure SQL Database the ultimate database platform choice to run your applications at a fast and furious speed.","eventName":"2018 Spring","sessionID":2942,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["SQL"],"tracks":["199"],"speakerNames":["Bob Ward"],"speakers":["1334"],"__v":0},{"_id":"5a206304e137e7380e34481e","ID":2941,"sessioncode":"SQ02","title":"Experience SQL Server on Linux and Containers","abstract":"<strong>Level: </strong>300-400<br /><br />SQL Server 2017 is all about choice. It now runs on the most popular platforms in the world: Windows, Linux, and Docker Containers. In this session we will focus on the specific features, architecture, and guidance for running SQL Server on Linux and Docker Containers. You will walk away with an understanding of how we built SQL Server on Linux and how it runs in a unique way that allows developers to focus on their applications vs the specifics of the design. We will also look at how Docker Containers work so you can see the unique value proposition this provides to developers using SQL Server. As with any advanced session, we will have demos including debugging sessions to show you how the design works.","eventName":"2018 Spring","sessionID":2941,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["SQL"],"tracks":["199"],"speakerNames":["Bob Ward"],"speakers":["1334"],"__v":0},{"_id":"5a0607151616ad90131eb17d","ID":2821,"sessioncode":"AP22","title":"Explore the Cosmos (DB) with .NET","abstract":"CosmosDB, formerly referred to as DocumentDB, is Microsoft's cloud-based NoSQL distributed database available on Azure. Learn how to build a .NET application to import data, stand up a RESTful API to access the data, and a single page application to access the data. Then see the application refactored to leverage Azure Functions and Blob Storage to create a truly serverless storage and compute experience in Azure.","eventName":"2018 Spring","sessionID":2821,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["ASP","AB"],"tracks":["197","200"],"speakerNames":["Jeremy Likness"],"speakers":["1526"],"__v":0},{"_id":"5a26d1726069b5a43845655b","ID":2996,"sessioncode":"SQ42","title":"From Zero to Hero: Troubleshooting SQL Server Performance Made Easier","abstract":"<strong>Level: </strong>200<br /><br />Take charge of any performance issue coming your way. \"SQL Server is hurting!\" Turn feelings to symptoms, and become the hero that saved the day. Streamline the process of troubleshooting performance issues with new tools and capabilities, for faster insights and effective turnaround.<br /><br />\nTopics covered include:<br />\n• Query Performance troubleshooting fundamentals.<br />\n• Analyzing query plan properties (Getting the execution context – what properties are available and what do they give you in showplan).<br />\n• Analyzing query plan properties (warnings and context, runtime stats).<br />\n• Bringing it all together with lightweight profiling and live troubleshooting scenario.","eventName":"2018 Spring","sessionID":2996,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["SQL"],"tracks":["199"],"speakerNames":["Pedro Lopes"],"speakers":["1575"],"__v":0},{"_id":"5a0328a0f2716bdc11fa6916","ID":2780,"sessioncode":"AB13","title":"Front-end web development in 2018, for the front-endally challenged Microsoft developer","abstract":"Front-end development for the web has changed a lot in the last few years…a LOT! Not necessarily for the better if you ask some, but at least to something different. With the relatively slow cadence in releases of Visual Studio, a lot of VS users have missed out on this shift. A lot of them still use NuGet for client-side resources and the ASP.NET Web Optimization Framework for bundling and minification. And even though this definitely works, and might even work very well, these are things that are changing.\nIn this talk, you will get a walkthrough of the tools and technologies all front-end developing code monkeys should be aware of. Not necessarily use, but at least be aware of… Having that said, you will not get a list of them in this abstract, as they are likely to have changed by the time this talk is actually presented.","eventName":"2018 Spring","sessionID":2780,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["AB","ASP"],"tracks":["200","197"],"speakerNames":["Chris Klug"],"speakers":["1344"],"__v":0},{"_id":"5a2570516069b5a438456517","ID":2965,"sessioncode":"SQ22","abstract":"<strong>Level: </strong>200<br /><br />Good developers are taught to reuse their code by putting it into functions. Unfortunately, SQL Server’s scalar functions and multi-statement table-valued functions have horrific performance downsides that you just can't fix. You’ll learn how to tell whether functions are killing your queries, and how to work around them.","title":"Functions: Why 2 out of 3 Functions Don't Scale","eventName":"2018 Spring","sessionID":2965,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["SQL"],"tracks":["199"],"speakerNames":["Brent Ozar"],"speakers":["1187"],"__v":0},{"_id":"5a20618ce137e7380e34481c","ID":2940,"sessioncode":"SQ01","title":"General Session: Experience SQL Server 2017: The Modern Database Platform","abstract":"SQL Server is no longer just a relational database management system. It has become a platform for data, both in your cloud and ours. This session will discuss all the new features and capabilities of SQL Server 2017 including SQL Server on Linux, Docker Containers, Graph Database, Python, Adaptive Query Processing, Automatic Tuning, and new HADR capabilities. We will even talk a few hidden gems included in the release.  This session will contain demos that showcase these capabilities and we will close the session with a discussion of SQL Server Futures and Roadmap.","eventName":"2018 Spring","sessionID":2940,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["SQL"],"tracks":["199"],"speakerNames":["Bob Ward"],"speakers":["1334"],"__v":0},{"_id":"5a049d2e1616ad90131eb138","ID":2788,"sessioncode":"AP06","title":"Get Git in an Hour","abstract":"Students with little or no Git experience will learn Git through a GUI. This presentation includes  introductory and intermediate Git topics, including creating a local and remote repository, cloning repositories,   branching, merging, resolving conflicts,  cherry picking, reversing commits, using tags, using the stash,  command line from the terminal.","eventName":"2018 Spring","sessionID":2788,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["ASP","AB"],"tracks":["197","200"],"speakerNames":["Jesse Liberty"],"speakers":["1134"],"__v":0},{"_id":"5a0602ef1616ad90131eb172","ID":2816,"sessioncode":"AP17","title":"Get Started with ASP.NET Core APIs for Angular","abstract":"Are you currently working with ASP.NET and beginning to invest in Angular? How do you start sharing your ASP.NET Core features with your Angular applications? How does ASP.NET handle security? The ASP.NET team will show you how to light up these features using ASP.NET Core APIs and also how to secure your application using Identity.","eventName":"2018 Spring","sessionID":2816,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["ASP","AB"],"tracks":["197","200"],"speakerNames":["Jasmine Greenaway"],"speakers":["1597"],"__v":1,"personas":[null],"products":[null],"tags":[null],"topics":[null]},{"_id":"5a25c7a26069b5a43845654a","ID":2989,"title":"Getting Started Developing .NET Cloud Applications on Azure using Visual Studio","abstract":"How easy is it to get .NET application to run in Azure? Do .NET applications run better in Azure, and how? In this talk we will walk through the unique enhancements we have built in to Azure for giving your .NET applications the best fit in the cloud. We’ll show you a fast path to get existing apps up on Azure. We’ll also show you how to build modern scalable cloud app patterns for Web App and worker microservices using Docker containers. We’ll also show you how to be incredibly productive building, monitoring and debugging your app using Visual Studio.","sessioncode":"AZ06","eventName":"2018 Spring","sessionID":2989,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["Azure","VS","AB"],"tracks":["201","196","200"],"speakerNames":["Andrew Hall","Paul Yuknewicz"],"speakers":["1502","1292"],"__v":1},{"_id":"5a031958f2716bdc11fa6901","ID":2770,"sessioncode":"AB03","title":"Getting Started with Angular and the CLI","abstract":"Angular provides a robust framework for building Single Page Applications (SPAs) that can run on a variety of devices. With the framework adding many new features ranging from ES2015 and TypeScript support to a more efficient way to bind data, there's a lot of new concepts to learn. In this session, Google GDE Dan Wahlin will dive into key features and concepts such as data binding, components, directives, using ES6/TypeScript languages, building reusable services and more. If you’re interested in getting a jump start on the Angular framework as well as seeing how the Angular CLI can be used to help you out then this session is for you!","eventName":"2018 Spring","sessionID":2770,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["AB","ASP"],"tracks":["200","197"],"speakerNames":["Dan Wahlin"],"speakers":["1022"],"__v":0},{"_id":"5a6f613cac33dfb8272e083c","ID":3058,"sessioncode":"SQ45","title":"Getting Started with Azure Infrastructure as a Service (IaaS)","abstract":"<strong>Level: </strong>200<br /><br />Do you need better scale and availability for your SQL Server environment? Azure Infrastructure as a Service can help. Come learn how easy it is to configure Azure virtual machines and migrate your workloads. This session will show you how to select the proper machine size and how to benchmark your environments, as well as discuss various methods to migrate from on-premises. We’ll also take a look at the built in monitoring features available within the Azure Portal to keep tabs on your environment. If you’ve been considering Azure IaaS for your organization, this session is for you!","eventName":"2018 Spring","sessionID":3058,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"topics":[null],"tags":[null],"personas":[null],"products":[null],"trackNames":["SQL"],"tracks":["199"],"speakerNames":["Tim Radney"],"speakers":["1227"],"__v":0},{"_id":"5a05f58f1616ad90131eb150","ID":2799,"sessioncode":"VS08","title":"Getting Started with Azure IoT Edge","abstract":"Microsoft has been a leader in cloud based IoT services for a number of years.  The heart of Azure’s IoT offering is IoT Hubs.  IoT Hubs provide a secure bidirectional communication service with devices in the field using standard protocols like HTTPS, AMQPS, and MQTTS.  The open standards make it possible for many but not ALL devices in the field to communicate directly with IoT Hubs.  For devices that don’t have TCP/IP connectivity but may have Bluetooth, RF, or other communication capabilities a gateway device is needed.  In addition, there is a common desire to do analytics and processing on device data without having to round trip to the edge.  In this session we’ll see how Azure IoT Edge (formerly the Azure IoT Gateway SDK) can be used to connect “edge” devices in the field to Azure IoT Hubs as well as how to move some of the analytics and filtering to the edge helping to reduce latency, bandwidth and costs when a roundtrip to the cloud can be avoided","eventName":"2018 Spring","sessionID":2799,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["VS","AB"],"tracks":["196","200"],"speakerNames":["Bret Stateham"],"speakers":["1440"],"__v":0},{"_id":"5a05f60c1616ad90131eb152","ID":2800,"title":"Getting Started with Blockchain Distributed Apps (DAPPs)","abstract":"Blockchain is fast becoming a popular alternative to traditional databases in applications where the integrity and lineage of data is paramount.  Although it came to the forefront with Bitcoin, it doesn’t just have to be used for trading crypto-currencies.  And with blockchain platforms like Ethereum the blockchain can store code in the form of Smart Contracts.  Using tools like Ethereum, Solidity, Truffle, TestRPC and more I’ll show you how to get started developing Distributed Applications or DAPPs.","sessioncode":"VS09","eventName":"2018 Spring","sessionID":2800,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["VS","AB"],"tracks":["196","200"],"speakerNames":["Bret Stateham"],"speakers":["1440"],"__v":0},{"_id":"5a0362131616ad90131eb133","ID":2786,"sessioncode":"AP05","title":"Getting Started with Node.js","abstract":"abstract coming soon","eventName":"2018 Spring","sessionID":2786,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["ASP","AB"],"tracks":["197","200"],"speakerNames":["Asim Hussain"],"speakers":["1524"],"__v":0},{"_id":"5a05b14c1616ad90131eb14a","ID":2796,"title":"Getting to the Core of .NET Core","abstract":".NET Core is truly a new technology that is fast, efficient, cross platform, and open source. It also shares many similarities with the .NET we’ve known and loved for years. This session explains exactly what .NET Core is but doesn’t stop there. We’ll dive deep into what the architecture and the runtime is – including how it works across different platforms like Windows. OSX, and Linux. This session will also explore how your apps are loaded and who hosts them, how the runtime finds tools to run commands on, and deeper subjects like what the muxer is, getting true side by side deployment, runtime identifiers, the.NET Standard, and more.","sessioncode":"VS06","eventName":"2018 Spring","sessionID":2796,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["VS","AB"],"tracks":["196","200"],"speakerNames":["Adam Tuliper"],"speakers":["1179"],"__v":0},{"_id":"5a12fba546276db406c23938","ID":2870,"sessioncode":"AZ05","title":"Going Serverless on Azure - you know, for scale!","abstract":"So there’s this buzz about “serverless”. Does it help you develop certain types of applications faster? Yes. Does it have an attractive cost proposition where you only pay for what you use? Check. Does it mean that you don’t have to manage resource allocation in the cloud, but focus instead on building that awesome service or app? Right again. These benefits of going serverless are all great. But one of the best features of all is how insanely easy it is to handle massive loads of data, requests, and compute demands, without lifting a finger.\n<br /><br />\nIn Azure, there are several technologies considered serverless. We will primarily be focused on Azure Functions for compute, Event Grid for messaging, and Azure Cosmos DB for data, all put to good use in a live demo. We’ll also touch on some newer things like Azure Container Instances, and all the other great things that makes serverless so buzz-worthy, but then we’ll focus on what really makes it special… you know, scale!","eventName":"2018 Spring","sessionID":2870,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["Azure"],"tracks":["201"],"speakerNames":["Joel Hulen"],"speakers":["1539"],"__v":1,"personas":[null],"products":[null],"tags":[null],"topics":[null]},{"_id":"5a2570aa6069b5a438456519","ID":2966,"sessioncode":"SQ23","abstract":"<strong>Level: </strong>300<br /><br />Making the right hardware selection decisions is extremely important for database scalability. Having properly sized and configured hardware can both increase application performance and reduce capital expenses dramatically. Unfortunately, there are so many different choices and options available when it comes to selecting hardware and storage subsystems, it is very easy to make bad choices based on outmoded conventional wisdom. This session will give you a framework for how to pick the right hardware and storage subsystem for your workload type. You will learn how to evaluate and compare key hardware components, such as processors, chipsets, and memory. You will also learn how to evaluate and compare different types of storage subsystems for different database workload types. This session will give you the knowledge you need to make sure you get the best performance and scalability possible from your hardware budget!","title":"Hardware 301: Diving Deeper into Database Hardware","eventName":"2018 Spring","sessionID":2966,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["SQL"],"tracks":["199"],"speakerNames":["Glenn Berry"],"speakers":["1285"],"__v":0},{"_id":"5a206978e137e7380e344832","ID":2951,"sessioncode":"SQ12","title":"High Availability/Disaster Recovery 101","abstract":"<strong>Level: </strong>100-200<br /><br />How do you design a SQL Server 2017 infrastructure in order to meet specific Recovery Time Objective (RTO) and Recovery Point Objective (RPO) service levels? There are many aspects to consider, from technology choices and licensing, to policies and procedures. This session outlines and compares the various HA/DR technologies available in SQL Server 2017, showing how you can combine them to design and build a solution to help meet your HA/DR goals. This session also teaches you how to formulate policies that enable effective use of technology in your organization.","eventName":"2018 Spring","sessionID":2951,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["SQL"],"tracks":["199"],"speakerNames":["Glenn Berry"],"speakers":["1285"],"__v":0},{"_id":"5a2572456069b5a43845651d","ID":2968,"sessioncode":"SQ25","abstract":"<strong>Level: </strong>200<br /><br />In-Memory OLTP is one of several “new” SQL Server technologies designed to help you make your applications just go faster. In this session we will demonstrate the speed improvements possible using memory-optimized tables, common use cases, and steps to migrate on-disk tables to in-memory tables.","title":"Hitting the Turbo Button with In-Memory OLTP","eventName":"2018 Spring","sessionID":2968,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["SQL"],"tracks":["199"],"speakerNames":["Justin Randall"],"speakers":["1335"],"__v":0},{"_id":"5a25ca8a6069b5a438456554","ID":2993,"sessioncode":"AZ10","abstract":"Earlier this year, we announced Azure Cosmos DB - the first and only globally distributed, multi-model database system. In this session, we will show you how you can take advantage of Azure Cosmos DB as your backend database, covering data replication across any number of regions, scaling for any number of reads/writes, and much more.","title":"How to Build a Massively Scalable Globally Distributed App in Minutes with Azure Cosmos DB","eventName":"2018 Spring","sessionID":2993,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["Azure","VS","AB"],"tracks":["201","196","200"],"speakerNames":["Microsoft Azure Team"],"speakers":["1482"],"__v":1},{"_id":"5a032560f2716bdc11fa6912","ID":2778,"sessioncode":"AB11","title":"How to hack a node app?","abstract":"Thought hacking was hard? It’s not, it’s easy and I’m going to show you how! In this episode of CSI Orlando we’ll investigate a series of hacking stories and break them down step-by-step to see exactly how they did it. By the end you’ll walk away a little bit more scared and a lot more prepared with some great practices you can apply immediately to your own applications.","eventName":"2018 Spring","sessionID":2778,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["AB","ASP"],"tracks":["200","197"],"speakerNames":["Asim Hussain"],"speakers":["1524"],"__v":0},{"_id":"5a05ffe91616ad90131eb166","ID":2810,"sessioncode":"AP11","title":"Improve Your Testing with Visual Studio 2017","abstract":"Come learn about significant enhancements recently brought to the testing experience in Visual Studio. This presentation will introduce and demo new features such as Real Time Test Discovery and the Hierarchy view in the Test Explorer. It will also go over the exciting capabilities added to Live Unit Testing such as the Skip test category as well as dive into a comprehensive demo of Live Unit Testing","eventName":"2018 Spring","sessionID":2810,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["ASP","AB"],"tracks":["197","200"],"speakerNames":["Kendra Havens"],"speakers":["1596"],"__v":1},{"_id":"5a25a7336069b5a43845651f","ID":2969,"sessioncode":"SQ26","abstract":"<strong>Level: </strong>200-300<br /><br />Have you ever wanted to know what the data looked like yesterday before a change was made? Have you cringed at the thought of creating triggers to get data changes logged for later analysis? Looking at a new feature in SQL 2016 called Temporal Tables gives you the ability to create a table that automatically keeps track of your data in time. Magic was never meant to be part of IT, but SQL Server has done a great job with this new feature. We will cover how to set it up, how it works, querying the tables including the history table and last but not least, how you can incorporate this feature into existing tables. Join me in a time travelling adventure to find out how you can leverage Temporal Tables in your world.","title":"In-depth Temporal Tables in SQL 2016","eventName":"2018 Spring","sessionID":2969,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["SQL"],"tracks":["199"],"speakerNames":["Ben Miller"],"speakers":["1342"],"__v":0},{"_id":"5a0602001616ad90131eb170","ID":2815,"sessioncode":"AP16","title":"Introducing ASP.NET Core","abstract":"Let's take a look at what's new in ASP.NET Core 2.0! A number of improvements big and small are here, and we walk you through them in this demo-filled session. See how ASP.NET Core simplifies development, improves performance, and increases security. We show how getting started with ASP.NET Core is easy with the new Razor Pages app model. See how ASP.NET Core 2.0 works great for microservices hosted in container-based infrastructure. Also, see how ASP.NET Core 2.0 is even better with Microsoft Azure by providing seamless diagnostics with Application Insights and worry-free security with Azure Active Directory (AD), Azure AD B2C and Azure Key Vault. With minimal slides and lots of tech, we prepare you for the next generation of cloud powered web apps.","eventName":"2018 Spring","sessionID":2815,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["ASP","AB"],"tracks":["197","200"],"speakerNames":["Jeff Fritz"],"speakers":["1109"],"__v":3,"personas":[null],"products":[null],"tags":[null],"topics":[null]},{"_id":"5a87564840267f7c09a05df0","ID":3073,"sessioncode":"AP24","abstract":"Want to harness the power of machine learning, but don’t have a team of data scientists on staff? Azure Cognitive Services has you covered! Infuse your apps, websites, and bots with intelligent algorithms to see, hear, speak, understand and interpret your user needs – and use the language you feel comfortable with (C#, Python, R, more!).\n<br /><br />\nIn this session, we’ll be walking through applied examples of Vision, Knowledge, Language, Speech, and Search. How old does Kevin Bacon look, really? Which pictures show a “cute fennec fox” versus a “cute red panda”? What does “Ich bin ein Berliner” mean in plain Mandarin? How many of the X-Men wear glasses? Learn the answers to these questions, and walk away with a collection of Jupyter notebooks with basic implementations of every Cognitive Service offering!","title":"Introduction to AI with Azure Cognitive Services","eventName":"2018 Spring","sessionID":3073,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"topics":[null],"tags":[null],"personas":[null],"products":[null],"trackNames":["ASP","AB","AI"],"tracks":["197","200","202"],"speakerNames":["Paige Bailey"],"speakers":["1616"],"__v":0},{"_id":"5a05f9551616ad90131eb15c","ID":2805,"sessioncode":"VS14","title":"Introduction to Containers","abstract":"Containers provide a way of running an application in a controlled environment, isolated from other applications running on the machine and from the underlying infrastructure. They are a cost-effective way of abstracting away the machine, ensuring that the application runs in the same conditions, from development, to test, to production. In this session, we'll demystify containers. You will learn why and when you might use containers, how to use them with both existing and new applications, who are the major players and what support both Visual Studio and Azure provide.","eventName":"2018 Spring","sessionID":2805,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["VS","AB"],"tracks":["196","200"],"speakerNames":["Robert Green"],"speakers":["1042"],"__v":0},{"_id":"5a049faf1616ad90131eb13e","ID":2791,"sessioncode":"AP09","title":"Introduction to IdentityServer for ASP.NET Core 2.0","abstract":"IdentityServer is a popular open source security token service framework written in ASP.NET Core that implements the OpenID Connect and OAuth2 protocols. It is used to authenticate users via single sign-on and to secure web APIs. It is designed for extensibility and customization and allows applications to satisfy their custom security requirements for single sign-in and API security. It can be used stand-alone or in conjunction with other identity providers (such as Google, Facebook, AAD, ADFS, Auth0, and others). Come to this session to be introduced to the basics of using, hosting, and configuring IdentityServer to secure your applications and APIs.","eventName":"2018 Spring","sessionID":2791,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["ASP","AB"],"tracks":["197","200"],"speakerNames":["Brock Allen"],"speakers":["1267"],"__v":0},{"_id":"5a20655fe137e7380e344826","ID":2945,"sessioncode":"SQ06","title":"Introduction to Performance Troubleshooting Using Wait Statistics","abstract":"<strong>Level: </strong>200-300<br /><br />One of the first things you should check when investigating performance issues are wait statistics - as these can often point you in the direction for further analysis. Unfortunately, many people misinterpret what SQL Server is telling them and jump to conclusions about how to solve the problem - what is often called 'knee-jerk performance tuning'. In this session, you will learn what waits are, how to analyze them, and potential solutions to common problem patterns.","eventName":"2018 Spring","sessionID":2945,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["SQL"],"tracks":["199"],"speakerNames":["Paul Randal"],"speakers":["1186"],"__v":0},{"_id":"5a256b7e6069b5a438456503","ID":2956,"sessioncode":"SQ13","title":"KEYNOTE: SentryOne Tools for Productivity and Performance","abstract":"<strong>Level: </strong>200<br /><br />Whether you are hosting in your office, in a data center, or in the cloud, SentryOne covers monitoring, alerting, and tuning to help you get the most out of your servers – including servers that aren’t running SQL Server. In this session, your hosts will guide you through time saving strategies for managing performance across hybrid environments - whether you are running physical or virtual servers, SQL Server, Azure SQL Database, APS, or Azure SQL Data Warehouse. You will see demonstrations of SentryOne software highlighting configuration and performance pitfalls, and leave with a better understanding of performance problems you may be currently missing. SentryOne provides a unified management experience; it’s your ONE platform for physical, virtual, and cloud performance.","eventName":"2018 Spring","sessionID":2956,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["SQL"],"tracks":["199"],"speakerNames":["Aaron Bertrand","Jason Hall"],"speakers":["1220","1355"],"__v":0},{"_id":"5a0c7d1a1616ad90131eb196","ID":2828,"sessioncode":"VS19","title":"Language & Artificial Intelligence for C# Enterprise Developers","abstract":"Recurrent Neural Networks (Language and text) made easy. Be amazed. The accelerated state of computation and mathematics are to a point where our mountains of data can be transiently interrogated for new trends and predictions. Language and text, though, is a special problem. Handling text from bots, voice commands, translation, and reliable sentiment analysis was once only accessible to high-end data scientists and spy movies. Today, simplified services wrap sophisticated systems with standard REST endpoints; they make language processing available to every developer, every app, and every enterprise. Discover the opportunity: Tomorrow, artificial intelligence will be as commonplace and transparent as multitasking, containers and garbage collection. In this session, learn where AI in Language is headed, but, most importantly, how you can use bite-sized artificial intelligence services in your apps right away.","eventName":"2018 Spring","sessionID":2828,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["VS","AI"],"tracks":["196","202"],"speakerNames":["Jerry Nixon"],"speakers":["1125"],"__v":0},{"_id":"5a05f67e1616ad90131eb154","ID":2801,"sessioncode":"VS10","title":"Lessons Learned from Real-World HoloLens & Mixed Reality Projects","abstract":"Developing mixed reality experiences for HoloLens & Mixed Reality (MR) headsets sounds fun in theory, but how does this translate to the real-world? This session is designed to assist teams who are exploring their first MR projects by drawing from lessons learned in the field when working on customer projects for HoloLens & MR. We’ll discuss the MR opportunity for .NET developers, what role they can play in MR development, and what an ideal MR development team looks like in comparison to a typical enterprise dev team. We’ll also look at how MR solutions can be integrated with cloud services and other systems to create real enterprise solutions. Lastly we’ll explore how you can execute your first MR projects as hackfests for fast results, and we’ll talk about design considerations, development tips & tricks, and common pitfalls to avoid. Applications in Mixed Reality span a wide range of industries, from construction, architecture and manufacturing, to healthcare, pharma, education and more. Regardless of what projects you work on today, come learn how Mixed Reality can open a new chapter in your career.","eventName":"2018 Spring","sessionID":2801,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["VS","AB"],"tracks":["196","200"],"speakerNames":["Nick Landry"],"speakers":["1162"],"__v":0},{"_id":"5a272ba76069b5a438456564","ID":2998,"sessioncode":"AI07","title":"ML for Developers in a Hurry","abstract":"Coming from a .NET enterprise world doesn’t prepare you for machine learning and AI, so it's tempting to pass it by. But you might be better equipped than you think.\nYou probably wrangle messy CSV files all the time. Denormalize data for reports. Maybe look for patterns with first and second statical moments in one column (that’s just the mean and deviation). You might compare two columns to see how often they “line up” (correlate). I know you’ve hand-coded some crazy business logic, intuiting there’s probably an easier way, using existing data. I’m writing the talk I wish I had seen 5 years ago, when I started learning this exciting new field. I’ll catch you up, from univariate analysis, correlations, simple linear regressions, then up to the big guns, gradient boosted trees (Microsoft’s XGBoost) and Deep Learning. We’ll use web resources, live coding and animations to make it click in a fun way. \n<br /><br />\nIf you want a pre-reading assignment, start with the big book, “Computer Age Statistical Reasoning”, particularly § 1, 2, 8, 12, 17, 18, 20, Epilogue. There’s 60+ years of good work by maths, stats and compute folks in there. Free PDF from Stanford at <a href=\"http://j.mp/CASI-book\">http://j.mp/CASI-book</a>. It’s deep. You’ll come back to it later.","eventName":"2018 Spring","sessionID":2998,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["AI","AB","VS"],"tracks":["202","200","196"],"speakerNames":["Scott Stanfield"],"speakers":["1576"],"__v":0},{"_id":"5a04a0291616ad90131eb140","ID":2792,"sessioncode":"AP10","title":"Make CSS Fun with SASS","abstract":"abstract coming soon","eventName":"2018 Spring","sessionID":2792,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["ASP","AB"],"tracks":["197","200"],"speakerNames":["Todd Anglin"],"speakers":["1019"],"__v":0},{"_id":"5a25a7ae6069b5a438456521","ID":2970,"sessioncode":"SQ27","abstract":"<strong>Level: </strong>200<br /><br />In-Memory OLTP in SQL Server 2016 has been reborn. Many limitations within the previous versions have been removed, making it a viable option for a variety of workloads. In this session, we will highlight critical issues in implementing and managing SQL Server 2016 instances and databases containing In-Memory tables.","title":"Managing In-Memory OLTP – a DBA Field Guide","eventName":"2018 Spring","sessionID":2970,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["SQL"],"tracks":["199"],"speakerNames":["Justin Randall"],"speakers":["1335"],"__v":1,"personas":[null],"products":[null],"tags":[null],"topics":[null]},{"_id":"5a034931f2716bdc11fa6929","ID":2785,"title":"Microservices, Angular, ASP.NET Core and Docker","sessioncode":"AP04","abstract":"In this session Microsoft MVP and Docker Captain Dan Wahlin will introduce the role microservices can play in today's enterprises and the pros/cons of using them. Learn how an Angular client can call into \"microservices\", how to create a RESTful microservice using ASP.NET Core and other technologies and the role Docker containers and Docker Compose can play in the process.","eventName":"2018 Spring","sessionID":2785,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["ASP","AB"],"tracks":["197","200"],"speakerNames":["Dan Wahlin"],"speakers":["1022"],"__v":0},{"_id":"5a12f88746276db406c23930","ID":2867,"sessioncode":"AZ02","title":"Microservices, Event Hubs, Functions and CosmosDB - a match made in eventual consistency heaven","abstract":"Microservices are not for everyone, but there are some incredible benefits to employing microservice architecture principles to enable co-evolution of services and features and reduce friction during the DevOps cycle. The growth of moving parts, however, does require tight DevOps procedures, and visibility into system operations including diagnostics, application events and audit trail. Event streaming can enhance your solution enabling async processing and scale, but also enhancing visibility to the solution as a whole. The good news is that if you are already designing a solution based on microservice principles, you are already positioned to incorporate events with less pain. Services that \"fit in your head\" lead to a manageable approach to introducing event-based strategies. In this session you'll learn how to design a microservices solution with Docker, that relies on event streams to produce workflow state, eventual consistency, history and full audit. This session will focus on implementations that are Azure-based, leveraging EventHubs, Functions and CosmosDB for the back end to a Docker-based microservices solution.","eventName":"2018 Spring","sessionID":2867,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["Azure","AB"],"tracks":["201","200"],"speakerNames":["Michele Leroux Bustamante"],"speakers":["1011"],"__v":1,"personas":[null],"products":[null],"tags":[null],"topics":[null]},{"_id":"5a05fb011616ad90131eb161","ID":2807,"sessioncode":"VS16","title":"Mobile DevOps with the Microsoft Stack","abstract":"DevOps is the union of people, process and our products to enable continuous delivery of value to our end users. Nowhere is this more important than the world of mobile apps. However, mobile presents its own set of unique challenges. See how Microsoft simplifies this entire process with Visual Studio Mobile Center. Visual Studio Mobile Center acts as your mission control center for mobile DevOps. With just a couple clicks implement the full DevOps stack. Continuous Integration, Continuous Testing, Continuous Delivery and Continuous Learning with integrated and easy to use dashboards.","eventName":"2018 Spring","sessionID":2807,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["VS","AB"],"tracks":["196","200"],"speakerNames":["Abel Wang"],"speakers":["1525"],"__v":0},{"_id":"5a06010c1616ad90131eb16a","ID":2812,"sessioncode":"AP13","title":"Modern Web and Cloud Development with .NET","abstract":"Containers are changing the way software is deployed in production. In this talk we'll cover how to use Docker and other container technologies to modernize the way you deploy your software to production. We'll cover the basics of containers development, including the Visual Studio family of tools for developing containerized apps. We'll then discuss how to setup a continuous deployment pipeline hosting options available for running containerized apps.","eventName":"2018 Spring","sessionID":2812,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["ASP","AB"],"tracks":["197","200"],"speakerNames":["Andrew Hall","Kendra Havens","Phillip Carter"],"speakers":["1502","1596","1595"],"__v":2,"personas":[null],"products":[null],"tags":[null],"topics":[null]},{"_id":"5a06007c1616ad90131eb168","ID":2811,"sessioncode":"AP12","title":"Modern front-end web development in Visual Studio 2017","abstract":"A lot of work has gone into making Visual Studio 2017 the fastest and most productive version ever. Join us for a tour of the new features for web developers that makes writing modern web applications easier, more productive and fun. We look at new techniques like \"dotnet new angular\" and see how ASP.NET Core and Visual Studio 2017 are a great partner for your front-end web development needs.","eventName":"2018 Spring","sessionID":2811,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["ASP","AB"],"tracks":["197","200"],"speakerNames":["Jeff Fritz"],"speakers":["1109"],"__v":1},{"_id":"5a7a1267610cdd98146d55d0","ID":3063,"sessioncode":"AB16","title":"Modernizing Applications with Docker","abstract":"Gain some significant benefits from the cloud without changing the core architecture of your application. During this initial modernization, you also can add assets from the cloud. You can add monitoring, with tools like Azure Application Insights; CI/CD pipelines for your app lifecycles, with Visual Studio Team Services; and many more data resource services that are available in Azure.","eventName":"2018 Spring","sessionID":3063,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"topics":[null],"tags":[null],"personas":[null],"products":[null],"trackNames":["AB","ASP"],"tracks":["200","197"],"speakerNames":["Shayne Boyer"],"speakers":["1210"],"__v":0},{"_id":"5a032234f2716bdc11fa690d","ID":2776,"sessioncode":"AB09","title":"Module vs Module","abstract":"What is the difference between ES modules and Angular 2 modules? This session answers that question and outlines best practices for using Angular modules. We'll look at how to refactor an application into multiple feature modules for clear organization and examine how to lazy load our modules.","eventName":"2018 Spring","sessionID":2776,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["AB","ASP"],"tracks":["200","197"],"speakerNames":["Deborah Kurata"],"speakers":["1211"],"__v":0},{"_id":"5a6f63d7ac33dfb8272e0840","ID":3059,"sessioncode":"SQ46","title":"Monitoring SQL Server to Make Your Life Easier","abstract":"Whether you are responsible for one database or a thousand databases on a hundred servers, knowing what to pay attention to is critical. If your server estate is growing, looking after them gets even more complicated. It’s easy to spend your day putting out fires instead of doing work that adds value to the company, and monitoring can help you avoid those fires in the first place. Attend this session to learn how monitoring can make your life easier.","eventName":"2018 Spring","sessionID":3059,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"topics":[null],"tags":[null],"personas":[null],"products":[null],"trackNames":["SQL"],"tracks":["199"],"speakerNames":["Kathi Kellenberger"],"speakers":["1608"],"__v":0},{"_id":"5a25c93b6069b5a43845654f","ID":2991,"sessioncode":"AZ08","title":"Moving Application Development and Testing to the Cloud","abstract":"Not every organization and application is ready to move to cloud for production for a variety of reasons. In this session we'll show you how organizations that have on-premise deployments are still able to take advantage of the cloud to create a productive and consistent environment for developing and testing their applications.","eventName":"2018 Spring","sessionID":2991,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["VS","Azure","AB"],"tracks":["196","201","200"],"speakerNames":["JC Selph"],"speakers":["1654"],"__v":2,"personas":[null],"products":[null],"tags":[null],"topics":[null]},{"_id":"5a2571676069b5a43845651b","ID":2967,"sessioncode":"SQ24","title":"Mythbusters","abstract":"<strong>Level: </strong>200-300<br /><br />It's amazing how many myths and misconceptions have sprung up and persisted over the years about SQL Server - after 19 years helping people out on forums, newsgroups, and customer engagements, Paul's heard it all. Are temporary tables always a good idea? Does using SSDs mean no fragmentation issues? Should you really plan a backup strategy? Should you add more memory to your server? These are just a few of many, many myths that Paul will debunk in this fast-paced session on how SQL Server operates and should be managed and maintained.","eventName":"2018 Spring","sessionID":2967,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["SQL"],"tracks":["199"],"speakerNames":["Paul Randal"],"speakers":["1186"],"__v":0},{"_id":"5a049ef71616ad90131eb13c","ID":2790,"sessioncode":"AP08","title":"Ngrx and Angular application state","abstract":"What’s all the noise about ngrx, the Angular version of react’s redux? Do you need it? What’s wrong with how you manage client-side state now? \n<br /><br />\nThis session will help you answer those questions for yourself. I’ll explain what ngrx is, with examples, call out some consequences, relate ngrx to alternatives.","eventName":"2018 Spring","sessionID":2790,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["ASP","AB"],"tracks":["197","200"],"speakerNames":["Ward Bell"],"speakers":["1107"],"__v":0},{"_id":"5a7b6dae823e9e100a58bf6c","ID":3064,"sessioncode":"VS22","title":"Pair Program with Fritz and Friends","abstract":"Jeff Fritz brings his live stream from Twitch to DevIntersection in this interactive session. Jeff and a guest will build a simple ASP.NET Core CMS and answer your questions about anything .NET or Visual Studio LIVE. Nothing is off-limits, and we’ll work through the project on stage and YOU can contribute. You'll not only learn how to build a simple ASP.NET Core application, but also have all of the source code at the end of the session, and even be listed as a contributor to the final project. Bring your fully charged laptop, your questions, and join the group working together.","eventName":"2018 Spring","sessionID":3064,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"topics":[null],"tags":[null],"personas":[null],"products":[null],"trackNames":["VS","AB"],"tracks":["196","200"],"speakerNames":["Jeff Fritz"],"speakers":["1109"],"__v":0},{"_id":"5a25a8306069b5a438456523","ID":2971,"sessioncode":"SQ28","abstract":"<strong>Level: </strong>200<br /><br />This session will cover real world functions that are used for real interaction with SQL Server. There will be a few slides but mostly demos with actual scripts that interact with SQL Server for management and getting data in and out. I will also introduce some outside modules created to assist as well. Things like Reading/Changing the following: Permissions, DB Owner maintenance and database space management. We all could use a few standard things in the SQL Server world of ever changing roles and “I have to have it now” stuff, that Management Studio can get in the way of getting it done faster. Join me for a fun PowerShell hour and never try to reuse a click again.","title":"Practical PowerShell for SQL Server","eventName":"2018 Spring","sessionID":2971,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["SQL"],"tracks":["199"],"speakerNames":["Ben Miller"],"speakers":["1342"],"__v":0},{"_id":"5a2068a2e137e7380e344830","ID":2950,"sessioncode":"SQ11","abstract":"<strong>Level: </strong>200<br /><br />Dynamic Management Views and functions allow you to easily see exactly what is happening inside your SQL Server instances and databases with a high level of detail. You can discover your top wait types, most CPU intensive stored procedures, find missing indexes, and identify unused indexes, to name just a few examples. This session presents, demonstrates and explains numerous DMV queries that you can quickly and easily use to detect and diagnose configuration and performance issues in your SQL Server instances and databases.","title":"Professor DMV: How to Use Dynamic Management Views to Diagnose SQL Server Performance Issues","eventName":"2018 Spring","sessionID":2950,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["SQL"],"tracks":["199"],"speakerNames":["Glenn Berry"],"speakers":["1285"],"__v":0},{"_id":"5a031f2ef2716bdc11fa690b","ID":2775,"sessioncode":"AB08","title":"React Patterns and Practices","abstract":"Getting started with React doesn't take very long, but there are a variety of other patterns and practices that you, as a developer, will need to understand and tackle.\n<br /><br />\nAfter this session you will be exposed to the following concepts that are helpful when creating a large front-end React application: <br />\n* Knowing the difference between Container and Presentational Components <br />\n* Stateless Functional Components <br />\n* Using High Order Components or Function as Children <br />\n* Assessing Performance Bottlenecks <br />\n* Integrating Immutability into your Application <br />\n* Adding redux & redux-devtools <br />\n* Adding react-router","eventName":"2018 Spring","sessionID":2775,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["AB","ASP"],"tracks":["200","197"],"speakerNames":["Elijah Manor"],"speakers":["1075"],"__v":0},{"_id":"5a031da8f2716bdc11fa6907","ID":2773,"sessioncode":"AB06","title":"RxJS Observables in Angular","abstract":"Client web applications are rich in events. Button clicks, keystrokes, and mouse moves are events. The data returned from an HTTP request arrives as an event. App components can send and receive messages through an event bus. Every page navigation is an event. Animations emit start and stop events.  Events are everywhere.\n<br /><br />\nRxJS Observables are the preferred way to manage events in Angular applications and many Angular APIs return RxJS Observables. \n<br /><br />\nThis session covers the basics of RxJS observables (the NEW 5.5 syntax!) for Angular developers. You'll learn how to work with Angular observable APIs, which RxJS operators you should know, and how to write your own observable APIs.","eventName":"2018 Spring","sessionID":2773,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["AB","ASP"],"tracks":["200","197"],"speakerNames":["Ward Bell"],"speakers":["1107"],"__v":0},{"_id":"5a25a8886069b5a438456525","ID":2972,"sessioncode":"SQ29","abstract":"<strong>Level: </strong>200<br /><br />SMO, short for Shared Management Objects (or SQL Management Objects to some), are some powerful programming interfaces to get and manipulate SQL Server in code. These objects are used in custom programs, in scripting with PowerShell and can be used to fully manage a SQL Server.  But what do you really do with them?  How do you use them? This session will cover some core objects that are used in every day interaction with SQL Server. I will cover how to get access to them, how to use them and best of all you will get to know these mysterious objects intimately so that you can get some real work done easily. Join me for some de-mystification of these objects and never be afraid again. Come get your geek on.","title":"SMO: A Study of the Server Management Objects","eventName":"2018 Spring","sessionID":2972,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["SQL"],"tracks":["199"],"speakerNames":["Ben Miller"],"speakers":["1342"],"__v":0},{"_id":"5a25a8fa6069b5a438456527","ID":2973,"sessioncode":"SQ30","abstract":"<strong>Level: </strong>300<br /><br />Introduced in SQL Server 2012, AlwaysOn Availability Groups is an enterprise-level high-availability and disaster-recovery solution. AlwaysOn Availability Groups maximizes the readiness of a set of user databases as an availability group that can fail over as a unit. \n<br /><br />\nIn this session, we will discuss the improvements available in SQL Server 2016 /2017 and how these improvements increase the viability to leverage AlwaysOn Availability groups as a High Availability / Disaster Recovery solution for reporting and OLTP workloads across Windows and Linux environments. Additionally, we will cover SQL Server 2016 specific capabilities such as improved log performance, multiple replica automatic-failover, failover based on database failure, readable secondaries for ‘round robin’ load-balancing, and basic AlwaysOn ‘Availability Groups’ for Standard edition.\n<br /><br />\nFinally, in SQL Server 2017, there are two different architectures for availability groups. AlwaysOn availability groups can now provide high availability, disaster recovery, and read-scale balancing. In Windows, failover clustering provides the cluster manager while in Linux, you can use Pacemaker. The other new architecture is a cluster-less, read-scale availability group. We will discuss how a read scale availability group provides support for non-HADR, read-only workloads.","title":"SQL Server 2016/2017: AlwaysOn Availability Groups – Windows and Linux Deployments","eventName":"2018 Spring","sessionID":2973,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["SQL"],"tracks":["199"],"speakerNames":["David Pless"],"speakers":["1224"],"__v":0},{"_id":"5a25ac386069b5a43845652d","ID":2976,"sessioncode":"SQ33","abstract":"<strong>Level: </strong>200<br /><br />In this session we will cover and demo many security features in SQL Server 2016/2017 such as Row Level Security, Dynamic Data Masking, Always Encrypted, Advanced Threat Detection, and the Azure Security Center covering SQL Server 2016/2017 and Azure SQL Database. \n<br /><br />\nRow-Level Security enables customers to control access to rows based on the characteristics of the user executing a query. RLS enables you to implement restrictions on data row access. For example, ensuring that workers can access only those data rows that are pertinent to their department, or restricting a customer's data access to only the data relevant to their company. Dynamic Data Masking limits (DDM) sensitive data exposure by masking it to non-privileged users. It can be used to greatly simplify the design and coding of security in your application. Always Encrypted is another feature designed to protect sensitive data stored in Azure SQL Database or SQL Server databases. Always Encrypted allows clients to encrypt sensitive data inside client applications and never reveal the encryption keys to the Database Engine (Azure SQL Database or SQL Server). These technologies can be used together to create a defense-in-depth strategy. We will cover these security features with an in-depth, demo focused delivery covering Azure SQL Database and SQL Server 2016/2017 on-prem.\n<br /><br />\nWe will also cover the Azure Security Center and Advanced Threat Detection which can be used to provide a dashboard for viewing and responding to security risks with a fully Power BI integrated solution. Azure SQL Database Threat Detection provides security by detecting activities which may indicate a threat such as SQL injection attacks. The benefits of Azure Threat Detection include configuration of SQL threat detection policy, email alerts upon detection, and Azure Portal and Microsoft Excel integration.","title":"SQL Server 2017 and Azure SQL DB: Security Smackdown","eventName":"2018 Spring","sessionID":2976,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["SQL"],"tracks":["199"],"speakerNames":["David Pless"],"speakers":["1224"],"__v":0},{"_id":"5a25a9906069b5a438456529","ID":2974,"sessioncode":"SQ31","title":"SQL Server 2017: Enterprise Reporting, Power BI Report Server and Mobile","abstract":"<strong>Level: </strong>200<br /><br />SQL Server 2016/2017 is packed with new capabilities with SQL Server Reporting Services, Mobile Report Publisher, and the new Power BI Report Server. In this session we will outline the new features and capabilities of SQL Server 2017 Reporting Services and Power BI Report Server that puts the power of data in the hands of everyone. We will cover the alignment of Microsoft’s hybrid reporting solutions. \n<br /><br />\nWe will dive into paginated and interactive mobile reporting, KPIs, dashboards, and other new features in both SQL Server 2017 and Power BI Report Server. Additionally, we will focus on the capabilities of ‘Mobile Report Publisher’ and web based deployments which allows for greater consumption of your report capabilities across the enterprise. Finally, we will cover Power BI Premium and the ability to license at capacity, give dedicated performance to PBI workloads, and Power BI embedded capabilities.","eventName":"2018 Spring","sessionID":2974,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["SQL"],"tracks":["199"],"speakerNames":["David Pless"],"speakers":["1224"],"__v":0},{"_id":"5a26d0e56069b5a438456559","ID":2995,"sessioncode":"SQ41","title":"SQL Server 2017: Intelligence - Meet Database","abstract":"<strong>Level: </strong>200<br /><br />SQL Server 2017 introduces groundbreaking query performance and diagnostics enhancements to truly add intelligence to SQL Server. From Adaptive Query Processing to diagnostics enhancements or new tools, SQL Server will handle a number of common scenarios automatically, or give you better insights into common performance scenarios such as use of Parallelism. Come join us in the intelligent database world starting with SQL Server 2017.","eventName":"2018 Spring","sessionID":2995,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["SQL"],"tracks":["199"],"speakerNames":["Pedro Lopes"],"speakers":["1575"],"__v":0},{"_id":"5a25abc86069b5a43845652b","ID":2975,"abstract":"<strong>Level: </strong>300<br /><br />Query Store is a feature as of SQL Server 2016 / Azure SQL Database V12. Query Store is designed to help with query performance troubleshooting by making it easier to identify poorly performing statements, address parameter sniffing issues, and finding scenarios where performance generally regresses. In this session we will cover how Query Store can help you identify changes in query plans and figure out when performance regressions occur. \n<br /><br />\nIf a query generates different plans, you can use Query Store to analyze the plan changes, identify performance degradation, and even force the query processor to use a particular plan for your query. These capabilities are enabled in the Query Store UI and in specific Query Store Dynamic Management Views.\n<br /><br />\nAdditionally, we will demo the new capabilities in SQL Server 2017 with Query Store reports, wait statistics analysis, and the execution plan information available in SQL Server Management Studio 17.x to help identify query plan issues quickly.\n<br /><br />\nFinally, we will cover Automatic Detection and Tuning in SQL Server 2017 where you can be notified when a potential performance issue is detected by the Database Engine to automatically correct performance problems. Automatic Tuning in SQL Server 2017 enables you to identify and fix performance issues caused by SQL plan choice regressions.","title":"SQL Server 2017: Query Store and Auto Tuning","sessioncode":"SQ32","eventName":"2018 Spring","sessionID":2975,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["SQL"],"tracks":["199"],"speakerNames":["David Pless"],"speakers":["1224"],"__v":0},{"_id":"5a206723e137e7380e34482c","ID":2948,"sessioncode":"SQ09","title":"SQL Server Indexing: Strategies for Performance","abstract":"<strong>Level: </strong>200<br /><br />SQL Server has clustered and nonclustered b-tree indexes, clustered and nonclustered columnstore indexes, and even a few other specialized types of indexes. It can be hard to know the correct direction to take for your data? Join Kimberly in this session to get an overview of when and why you should use combinations of these with emphasis on answering these main questions:\n<br /><br />\n1. How does SQL Server version affect indexing choices / strategy?<br />\n2. What criteria should you look for in data access patterns and usage patterns?<br />\n3. What makes a good base table structure (clustered b-tree v. clustered columnstore)?<br />\n4. What can you do now? What are your plans for migration?\n<br /><br />\nIf you want to know the RIGHT way to index your tables – from DESIGN to TEST to PRODUCTION – this is the place to be!","eventName":"2018 Spring","sessionID":2948,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["SQL"],"tracks":["199"],"speakerNames":["Kimberly L. Tripp"],"speakers":["1184"],"__v":0},{"_id":"5a2067bde137e7380e34482e","ID":2949,"sessioncode":"SQ10","title":"SQL Server Indexing: Tools and Tuning Walkthrough","abstract":"<strong>Level: </strong>300<br /><br />In the prior session, we looked at index types – rowstore v. columnstore as well as the requirements tied to SQL Server version; however, that session is all about concepts, choices, and strategies. That first session is about knowing the right direction and some of the core / critical principles but this session is about how to move forward and tackle a specific query’s performance problem. In this session we’ll look at query plans, statistics IO, showplan’s index recommendation (the green hint), and the index tuning wizard. All of these tools can be both incredibly helpful but also misleading. Kimberly will cover how to use these tools effectively so that you know how to best tune your queries reducing both time and effort on your time but also with better results!","eventName":"2018 Spring","sessionID":2949,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["SQL"],"tracks":["199"],"speakerNames":["Kimberly L. Tripp"],"speakers":["1184"],"__v":0},{"_id":"5a25c28d6069b5a438456542","ID":2985,"sessioncode":"AI02","title":"Sophisticated use cases for Custom Vision","abstract":"When we announced the preview version of Microsoft Custom Vision at Build last May, we showed how customers can train a custom machine learning model with images from their own data stores. A retailer or manufacturer could train a model with photographs of their products. Images are then sent to this model, and a prediction is returned as to the matching item. Enterprises have complex computer vision scenarios that require manual, labor intensive tasks to complete---let’s learn how they can automate these tasks with accuracy and at scale.","eventName":"2018 Spring","sessionID":2985,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["AI","AB"],"tracks":["202","200"],"speakerNames":["Microsoft AI Team"],"speakers":["1574"],"__v":0},{"_id":"5a25b22e6069b5a438456531","ID":2978,"sessioncode":"SQ35","abstract":"<strong>Level: </strong>200<br /><br />How you execute your data requests can affect performance, caching, and reuse. Did you ever wonder where that estimate (in the showplan) comes from? Is it correct or, is it way off? Why? You’ve probably heard that many of your problems are related to statistics. Potentially, you’ve even rebuilt statistics only to find that it “fixes” the problem. However, what you might be seeing is a false positive. And, it doesn’t always work. Come to this session to find out how you should be executing your statements for the best performance, caching, and reuse! We'll look at adhoc statements, dynamically constructed statements, and sp_executesql (e.g. forced statement caching). We will round out the session for how to best setup your server for better plan cache management so that your cache doesn’t become bloated from adhoc executions!","title":"Statement Execution, Caching, and Reducing Plan Cache Bloat","eventName":"2018 Spring","sessionID":2978,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["SQL"],"tracks":["199"],"speakerNames":["Kimberly L. Tripp"],"speakers":["1184"],"__v":0},{"_id":"5a20648ae137e7380e344824","ID":2944,"sessioncode":"SQ05","abstract":"<strong>Level: </strong>300<br /><br />In this follow-on session (to Estimates & Statistics: Parameters, Literals, and Variables), Kimberly will define and demo when and how statistics are used as well as why it’s so important to have accurate and up-to-date statistics. If you’ve been confused about histograms, when and how to update statistics, the inaccuracy of statistics on very large tables (and the limits of the histogram), then this is the place to be!","title":"Statistics: Understanding, Updating, and Improving Performance","eventName":"2018 Spring","sessionID":2944,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["SQL"],"tracks":["199"],"speakerNames":["Kimberly L. Tripp"],"speakers":["1184"],"__v":0},{"_id":"5a272c956069b5a438456566","ID":2999,"title":"Survive the Titanic with Machine Learning","sessioncode":"AI08","abstract":"RMS Titanic sank on April 15, 1912: over 700 of the 2200 passengers survived. Why? Although some element of luck was involved, some passenger groups were more likely to survive than others, namely women, children and the upper-class. I’ll do a complete walk through, from scratch, building a temporary machine-learning rig in the cloud, to find the best ML algorithm to save those passengers! Our toolkit will be Linux, Microsoft R Open 3.4, Microsoft LightGBM (maybe), and vim.","eventName":"2018 Spring","sessionID":2999,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["AI","VS","AB"],"tracks":["202","196","200"],"speakerNames":["Scott Stanfield"],"speakers":["1576"],"__v":0},{"_id":"5a25b2d26069b5a438456533","ID":2979,"sessioncode":"SQ36","abstract":"<strong>Level: </strong>200<br /><br />TempDB is a critical shared resource on every SQL Server instance. In this session, DBAs and Developers will learn the role of TempDB in query processing and SQL Server maintenance tasks, and leave with a checklist of essential items covering configuration, monitoring, and performance troubleshooting.","title":"TempDB Configuration, Monitoring, and Troubleshooting for Performance","eventName":"2018 Spring","sessionID":2979,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["SQL"],"tracks":["199"],"speakerNames":["Justin Randall"],"speakers":["1335"],"__v":0},{"_id":"59e4e701a4cd12f41e1f3cd5","ID":2751,"sessioncode":"VS02","title":"The Architect","abstract":"The software industry is in a deep crisis. Projects suffer from low quality; schedule slips and cost overrun are common. But this is hardly ordained, since there are plenty of examples of projects done on schedule, on budget, on quality in a repeatable manner. The key for solving the crisis is to practice software development as an engineering discipline, just like it is done in mechanical or electrical engineering. That is exactly the responsibility of the modern software architect, which must address software systems from an engineering standpoint, applying age-old engineering practices to software development. Armed with that crucial observation Juval will share his perspective on what is the key set of skills required of the architect, the role architects have to plan in order for the project to succeed, what it implies both to companies and to individual architects, and how should architects navigate and manage their own career path and personal growth.","eventName":"2018 Spring","sessionID":2751,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["VS","AB"],"tracks":["196","200"],"speakerNames":["Juval Lowy"],"speakers":["1188"],"__v":0},{"_id":"5a0322b5f2716bdc11fa690f","ID":2777,"sessioncode":"AB10","title":"The Many Adventures of Angular Routing","abstract":"The Router can do so much more than just route the user between the views of our applications. In this presentation, we'll look at many of the other features and capabilities of the Angular router.","eventName":"2018 Spring","sessionID":2777,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["AB","ASP"],"tracks":["200","197"],"speakerNames":["Deborah Kurata"],"speakers":["1211"],"__v":0},{"_id":"5a25c3cb6069b5a438456548","ID":2988,"sessioncode":"AI05","title":"The Team Data Science Process (TDSP) and DevOps for Data Science","abstract":"Most data science discussions start with everything in place, data loaded, and ready to be analyzed. But in the real world, it’s hardly that simple. There are many surface areas to take care of, from networking to security to data ingress patterns and more, that have to be thought out, planned, prepared and managed. The team that manages standard developer operations, or DevOps, is often pressed into service for these tasks, but there are many ways that a data science project differs from a standard application – and you need to know how to work with the DevOps team or perhaps even take that on yourself for advanced analytics.","eventName":"2018 Spring","sessionID":2988,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["AI","AB"],"tracks":["202","200"],"speakerNames":["Paige Bailey"],"speakers":["1616"],"__v":1,"personas":[null],"products":[null],"tags":[null],"topics":[null]},{"_id":"5a032b12f2716bdc11fa6923","ID":2782,"sessioncode":"AP01","title":"The Whirlwind tour of Authentication and Authorization with ASP.NET Core","abstract":"Authentication and authorization is not a fun topic for most people. It is generally that thing that has to be there, but nobody really cares about. And on top of that, every time the requirements are a little different. And every time we have to figure out how to write all the plumbing to get it done properly. It is security after all…<br /><br />\nIn ASP.NET Core, Microsoft has made it fairly easy to get it all done. In most cases, it is only a few lines of code and some minor configuration, and you are up going. However, if you don’t know the lines of code and the config, it can be hard. \nIn this presentation, you will see a whole heap of different types of authN and authZ being configured and used. There will be social logins, local logins, AD-based logins, and even token based authentication for SPAs. Basically, everything you need to get up and running when it comes to authenticating your users in ASP.NET Core.","eventName":"2018 Spring","sessionID":2782,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["ASP","AB"],"tracks":["197","200"],"speakerNames":["Chris Klug"],"speakers":["1344"],"__v":0},{"_id":"5a12fb1046276db406c23935","ID":2869,"sessioncode":"AZ04","title":"Top 10 things developers need to know about Azure Active Directory","abstract":"Azure Active Directory (AAD) has become one of the most widely used and popular ways of authenticating to both Microsoft and non-Microsoft services.  This session will explore 10 amazing and exciting things about Azure Active Directory that will support your custom application development and security needs.","eventName":"2018 Spring","sessionID":2869,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["Azure"],"tracks":["201"],"speakerNames":["Chris Givens"],"speakers":["1538"],"__v":1,"personas":[null],"products":[null],"tags":[null],"topics":[null]},{"_id":"5a25c3516069b5a438456544","ID":2986,"sessioncode":"AI03","title":"Training Real-World AI with High Fidelity Simulations","abstract":"AI depends on learning. Learning comes from lots of experience. We call that experience data. The challenge is having enough data to train our AI systems. This leads to an exciting area of AI around using high fidelity simulations to generate enough data to train an AI system that can be used in the real world. In this session we will explore how a simulation can be used to learn and train autonomous vehicles and drones.","eventName":"2018 Spring","sessionID":2986,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["AI","AB"],"tracks":["202","200"],"speakerNames":["Paul Stubbs"],"speakers":["1509"],"__v":1,"personas":[null],"products":[null],"tags":[null],"topics":[null]},{"_id":"5a25b31e6069b5a438456535","ID":2980,"sessioncode":"SQ37","abstract":"<strong>Level: </strong>200<br /><br />You're tired of hearing that you're not supposed to SELECT * - you just have to do it because of your application. Learn when it isn't all that bad, and how you can tweak the queries and indexes to make it faster.","title":"Tuning for SELECT *","eventName":"2018 Spring","sessionID":2980,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["SQL"],"tracks":["199"],"speakerNames":["Brent Ozar"],"speakers":["1187"],"__v":0},{"_id":"5a049e131616ad90131eb13a","ID":2789,"sessioncode":"AP07","title":"TypeScript for C# Programmers","abstract":"TypeScript is the language of choice wherever you might have used JavaScript.  Traditionally, TypeScript is taught from the perspective of JavaScript programmers, but this course is targeted at C# programmers who bring different experience and different challenges.   Topics include the fundamentals and how they differ from C#, creating and using classes and objects,  interfaces, inheritance, etc.","eventName":"2018 Spring","sessionID":2789,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["AB","ASP"],"tracks":["200","197"],"speakerNames":["Jesse Liberty"],"speakers":["1134"],"__v":0},{"_id":"5a04a2f51616ad90131eb144","ID":2794,"sessioncode":"VS04","title":"Using the Azure Bot Service to Create Intelligent Bots","abstract":"Bots are powering a new way to converse and interact with users, whether you are ordering pizza with an emoji via text, remotely checking into your hotel room or searching for information. Bots can power both text based and voice activated conversations so users can leverage the mode most convenient to them. In this session we’ll take a journey building a solution that leverages Cortana, the Microsoft Bot Framework, Microsoft Cognitive services and most importantly the Azure Bot Service to make an application come alive to spoken and typed conversations.","eventName":"2018 Spring","sessionID":2794,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["Azure","VS","AB"],"tracks":["201","196","200"],"speakerNames":["Zoiner Tejada"],"speakers":["1012"],"__v":0},{"_id":"5a0c7cab1616ad90131eb194","ID":2827,"sessioncode":"VS18","title":"Vision & Artificial Intelligence for C# Enterprise Developers","abstract":"Convolutional Neural Networks (Vision and imaging) made easy. Be amazed. The accelerated state of computation and mathematics are to a point where our mountains of data can be transiently interrogated for new trends and predictions. Vision and imaging, though, is a special problem altogether. Handling images, scans, pictures, and videos was once only accessible to high-end data scientists and spy movies. Today, simplified services wrap sophisticated systems with standard REST endpoints; they make vision processing available to every developer, every app, and every enterprise. Discover the opportunity: Tomorrow, artificial intelligence will be as commonplace and transparent as multitasking, containers and garbage collection. In this session, learn where AI in Vision is headed, but, most importantly, how you can use bite-sized artificial intelligence services in your apps right away.","eventName":"2018 Spring","sessionID":2827,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["VS","AI"],"tracks":["196","202"],"speakerNames":["Jerry Nixon"],"speakers":["1125"],"__v":0},{"_id":"5a031849f2716bdc11fa68fc","ID":2768,"sessioncode":"AB01","abstract":"If you feel like modern web development with Angular and React has gotten way too complicated, Vue.js might be the JavaScript framework for you. With over 10K stars on Github, Vue.js has vaulted out of relative obscurity to find companies such as GitLab choosing to use it over React. In this session, we’ll take a look at why Vue.js is so popular, what makes it different from Angular and React and how easy it is to stand up and deploy a simple Vue.js application. Vue.js is a brilliant piece of JavaScript engineering, and it just might make you rethink your next app.","title":"Vue.js - The Next Big Thing In JavaScript","eventName":"2018 Spring","sessionID":2768,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["AB","ASP"],"tracks":["200","197"],"speakerNames":["John Papa"],"speakers":["1002"],"__v":1,"personas":[null],"products":[null],"tags":[null],"topics":[null]},{"_id":"5a8755e640267f7c09a05dee","ID":3072,"sessioncode":"AP23","title":"What exactly are Data Science and Deep Learning Virtual Machines?","abstract":"What is the difference between machine learning and deep learning? When should you use one versus another? How should you provision hardware for typical machine learning projects, and what are the advantages / disadvantages of each configuration?\n<br /><br />\nIf you’ve heard about things like TensorFlow, Spark, Jupyter Notebooks, and the Azure Machine Learning Workbench, and what to know where they would fit in your organization, this is the talk for you.","eventName":"2018 Spring","sessionID":3072,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"topics":[null],"tags":[null],"personas":[null],"products":[null],"trackNames":["ASP","AB"],"tracks":["197","200"],"speakerNames":["Paige Bailey"],"speakers":["1616"],"__v":0},{"_id":"5a06019f1616ad90131eb16e","ID":2814,"sessioncode":"AP15","title":"What's New in C#","abstract":"Microsoft’s new delivery cadence means you’ve got new features in your hands every few months with multiple versions of C# 7 available and new features in each Visual Studio 2017 update. Everything you've always done continues to work, but new features let you do it better. In this session, you'll learn how the latest features can improve your code and make you more productive. You'll see demos of the new features in scenarios that you can use immediately. You’ll also get a sneak peek at potential C# 8 features that attack root causes of common development. By the end of the session, you’ll be ready to embrace new features and new habits for better C# development.","eventName":"2018 Spring","sessionID":2814,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["ASP","AB"],"tracks":["197","200"],"speakerNames":["Kathleen Dollard"],"speakers":["1007"],"__v":1},{"_id":"5a25c3896069b5a438456546","ID":2987,"sessioncode":"AI04","title":"What’s New with the Cortana Skills Kit","abstract":"The Cortana Skills Kit is a collection of APIs and technologies used to create personalized, AI-driven experiences for your users. In this session, we'll learn about Cortana, discuss new features of the skills kit, and build a skill step-by-step. Skills built in this session will work across Windows 10, Android, iOS, and headless devices such as the Harman Kardon Invoke. Following this talk, you’ll understand how Cortana skills work, be able to build your own skill, and know where to go for help and support along the way.","eventName":"2018 Spring","sessionID":2987,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["AI","AB"],"tracks":["202","200"],"speakerNames":["Paul Stubbs"],"speakers":["1509"],"__v":1,"personas":[null],"products":[null],"tags":[null],"topics":[null]},{"_id":"5a25b4446069b5a438456539","ID":2982,"sessioncode":"SQ39","abstract":"<strong>Level: </strong>300<br /><br />Performance Monitor is one of the most misunderstood tools for any SQL developer or administrator. Mastering this tool can unlock secrets that no other toolset can easily expose. In this session we will look at not only how to effectively capture and measure perfmon counters, but we will also look at which counters are important for troubleshooting, when to use them, important combinations of counters, and how to use these counters to troubleshoot common SQL Server issues.","title":"Why All SQL Developers Should Use Perfmon Counters","eventName":"2018 Spring","sessionID":2982,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["SQL"],"tracks":["199"],"speakerNames":["Tim Chapman"],"speakers":["1221"],"__v":0},{"_id":"5a0601621616ad90131eb16c","ID":2813,"title":"Why you should use F#","sessioncode":"AP14","abstract":"F# is a functional programming language that runs on .NET. It is a perfect fit for developing backend services on .NET Core, modeling complex domains, and dealing with difficult data access problems.  In fact, it powers the backends of some of our top customers in Azure! In this talk, we'll introduce F# on .NET Core while walking through its benefits, talk about the excellent support it has across multiple tools, and show how it's a perfect fit for your next backend service. Come see what F# has to offer you!","eventName":"2018 Spring","sessionID":2813,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["ASP","AB"],"tracks":["197","200"],"speakerNames":["Phillip Carter"],"speakers":["1595"],"__v":1},{"_id":"5a25b4c66069b5a43845653b","ID":2983,"sessioncode":"SQ40","abstract":"<strong>Level: </strong>300<br /><br />CPUs are running faster now than ever before, solid-state drives are replacing spinning disks, and database servers have terabytes of RAM. And yet we still suffer from poor database performance. Why? Because a poorly written query will bring even the best hardware to its knees. For truly great performing systems there is no substitute for properly written queries, good indexes, and a database design that takes advantage of all SQL Server has to offer. And for this we rely on the skills and expertise of DBAs and database developers.  Join Microsoft SQL Server Certified Master, Tim Chapman to learn how to spot common query performance killers and how you can take advantage of features found in SQL Server 2014+ to make your queries as fast as possible.","title":"Writing Faster Queries","eventName":"2018 Spring","sessionID":2983,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["SQL"],"tracks":["199"],"speakerNames":["Tim Chapman"],"speakers":["1221"],"__v":0},{"_id":"5a031cdaf2716bdc11fa6905","ID":2772,"title":"Yes, VS Code Can Do That!","abstract":"How do you debug so easily in VS Code? What's are those key combinations to edit code so quickly? What extensions are the ones I shouldn't code without? Get ready to hit the ground running in this fast-paced, demo-heavy talk that takes you through some of the best and most efficient tips and tricks in VS Code. Learn how to setup your environment and customize it the way you like it. You'll walk out with several tips on how to be more efficient with one of the hottest tools on the Web today!","sessioncode":"AB05","eventName":"2018 Spring","sessionID":2772,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["AB","VS"],"tracks":["200","196"],"speakerNames":["John Papa"],"speakers":["1002"],"__v":0},{"_id":"5a05f8081616ad90131eb158","ID":2803,"sessioncode":"VS12","title":"Your Mouse is Stealing Your Time","abstract":"Tapping keys. It's the one thing every developer on every platform in every language does countless times per day, and the general rule is that fewer taps are better. This one cross-cutting concern is ripe with opportunities to improve your productivity and efficiency.\n<br /><br />\nIn this session, we'll look at… <br />\n• how to move more of your tasks to the command line <br />\n• how to identify and automate especially time sucking tasks <br />\n• how to commit keyboard shortcuts to memory <br />\n• how to start using keyboard shortcuts where you couldn't before <br />\n• how to use the keyboard on tasks you might not today such as managing github repos, browsing the operating system UI, fetching data from the web, and even moving your \n  mouse cursor <br />\n• how to improve your overall development speed","eventName":"2018 Spring","sessionID":2803,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["VS","AB"],"tracks":["196","200"],"speakerNames":["Jeremy Foster"],"speakers":["1439"],"__v":0},{"_id":"5a05fab51616ad90131eb15f","ID":2806,"sessioncode":"VS15","title":"Zero to DevOps","abstract":"DevOps is the union of people, process and our products to enable continuous delivery of value to our end users. This is ridiculously important in our world today but is very difficult to do right. Come see how to implement Zero to DevOps for any language, any platform with the Microsoft Stack. This talk features many war stories, real world successes as well as many fast paced demos using C#, Java, Node, Containers etc.","eventName":"2018 Spring","sessionID":2806,"roomID":110,"roomName":"TBD","timeSlot":208,"startTime":"2018-03-26T09:00","endTime":"2018-03-26T16:00","date":"03/26/2018","hidden":false,"trackNames":["VS","AB"],"tracks":["196","200"],"speakerNames":["Abel Wang"],"speakers":["1525"],"__v":0}]